print("Вывод 100 чисел спиралью")
L=[s for s in range(100)]
d=9         #переменная, необх-я для первого числа внутреннего цикла внутри строки (середина строки)
dplus=7     #на данную переменную увеличиваем d, затем домножаем ее на 4. Нашел след-щую законом-ть в каждой строке: 36=4*9, 64=4*(9+7), 84=4*(9+5)
a=[]        #первое(-ые) число(-а) в строке
t=[]        #последнее(-ие) число(-а) в строке
k=8         #длина строки в середине
k2=2        #длина строки, начиная с 5 строки спирали (с середины спирали)
d2=99       #первое число во второй половине спирали
dplus2=-6   #след. ряд первых чисел в средней строке: 99, 93=99-6, 79=93-(6+8), 57=79-(6+8+8)
#в целом подход следующий: каждая строка (за исключ-м первой и последней) состоит из 3 строк, в каждой есть определенные закономерности
for z in range(10): #первая строка спирали просто печатается
    print("   ",L[z],end="")

print()
for q in range(1,9): #8 строк с помощью цикла
    if q<5: #первая половина спирали
        a.append(d*4)   #=36 в первом цикле
        if q==1: print("  ",L[a[0]-1],end="")  #начало строки 
        if q==2: print("  ",L[a[0]-2]," ",L[a[1]-1],end="")
        if q==3: print("  ",L[a[0]-3]," ",L[a[1]-2]," ",L[a[2]-1],end="")
        if q==4: print("  ",L[a[0]-4]," ",L[a[1]-3]," ",L[a[2]-2]," ",L[a[3]-1],end="")

        for i in range(d*4,d*4+k):  #середина строки
            print("  ",L[i],end="")

        if q==1: t.append(d+1)
        t.append(L[d*4+k])
        if q==1: print("  ",L[t[0]]) #конец строки
        if q==2: print("  ",L[t[1]]," ",L[t[0]+1])
        if q==3: print("  ",L[t[2]]," ",L[t[1]+1]," ",L[t[0]+2])
        if q==4: print("  ",L[t[3]]," ",L[t[2]+1]," ",L[t[1]+2]," ",L[t[0]+3])
        
        k-=2
        d+=dplus
        dplus-=2
        
    else: #вторая половина спирали
        if q==8: print("  ",L[a[0]-8],end="")  #начало строки 
        if q==7: print("  ",L[a[0]-7]," ",L[a[1]-6],end="")
        if q==6: print("  ",L[a[0]-6]," ",L[a[1]-5]," ",L[a[2]-4],end="")
        if q==5: print("  ",L[a[0]-5]," ",L[a[1]-4]," ",L[a[2]-3]," ",L[a[3]-2],end="")

        for i in range(d2,d2-k2,-1):  #середина строки
            print("  ",L[i],end="")

        if q==8: print("  ",L[t[0]+7]) #конец строки
        if q==7: print("  ",L[t[1]+5]," ",L[t[0]+6])
        if q==6: print("  ",L[t[2]+3]," ",L[t[1]+4]," ",L[t[0]+5])
        if q==5: print("  ",L[t[3]+1]," ",L[t[2]+2]," ",L[t[1]+3]," ",L[t[0]+4])
        
        k2+=2
        d2+=dplus2
        dplus2-=8

for f in range(27,17,-1): #последняя строка также просто печатается
    print("  ",L[f],end="") 
